app/controllers/events_controller.rb

INSERT INTO "events" ("content", "created_at", "event_date", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "picture_file_name" = 'event-img1.jpg', "picture_content_type" = 'image/jpeg', "picture_file_size" = 46437, "picture_updated_at" = '2014-08-21 14:07:22.330998', "updated_at" = '2014-08-21 14:07:22.882257' WHERE "events"."id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])