app/controllers/welcome_controller.rb

  def index
    @events=Event.first(3)
---
SELECT "events".* FROM "events" LIMIT 3

  def about
    @events=Event.last(3)
---
SELECT "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT 3